Yu-Ting-Sun/yiki-m55m1/main.cpp
/**************************************************************************//**
 * @file     main.cpp
 * @brief    Day-1 dual-model feasibility PoC for NuMaker-M55M1.
 *
 * Proves Face + Gesture YOLOv8n models can co-reside in non-overlapping
 * HyperRAM slots and be inferred alternately on the single Ethos-U55, with a
 * boot-time integrity self-check (size + CRC32) and an NPU-actually-ran sanity
 * check (output tensor must not be all-zero).
 *
 * Test sequence:
 *   Test 1  Load both models from SD -> HyperRAM, verify size+CRC.
 *   Test 2  Face inference x100   (latency stats + output sanity).
 *   Test 3  Gesture inference x100 (latency stats + output sanity).
 *   Test 4  Alternating switch x500 (shared arena, re-Init per switch).
 *
 * @copyright SPDX-License-Identifier: Apache-2.0
 ******************************************************************************/
#include <cstdio>
#include <cstring>
#include <cstdint>

#include "NuMicro.h"
#include "BoardInit.hpp"
#include "log_macros.h"
#include "mpu_config_M55M1.h"     /* eMPU_ATTR_CACHEABLE_WTRA */

#include "MemoryLayout.h"
#include "ModelLoader.h"
#include "PerfTimer.h"
#include "FaceModel.hpp"
#include "GestureModel.hpp"
#include "Display.h"
#include "Slideshow.h"
#include "StoryUI.h"
#include "Camera.h"
#include "FaceDetect.hpp"
#include "FaceRecog.hpp"
#include "esp_probe.h"
#include "day2_test.h"
#include "day3_demo.h"

/* 1 = Day-2 Task 0: ESP-12F firmware probe. Runs INSTEAD of everything else
 *     (slideshow and dual-model tests) and never returns — set back to 0
 *     once the probe verdict is recorded. Takes priority over RUN_SLIDESHOW.
 *     Verdict 2026-07-07: AT_FIRMWARE_PRESENT @115200 (AT 1.7.0.0/SDK 3.0.0). */
#define RUN_ESP_PROBE      (0)   /* 0 for the slideshow milestone; flip to 1 to run the Day-2 ESP probe */

/* 1 = Day-2 Tasks 1-4: Wi-Fi + HTTP link validation against the FastAPI
 *     backend. Fill day2_config.h (SSID/password/backend IP) first!
 *     Runs after PerfTimer_Init (esp_at layer needs GetSystemTick_ms) and
 *     never returns. Priority: RUN_ESP_PROBE > RUN_DAY2_TESTS > slideshow. */
#define RUN_DAY2_TESTS     (0)

/* 1 = Day-3 demo: photo-frame layout (photos left 640x480, story rail right)
 *     with a LIVE LLM story — Wi-Fi up, POST /generate, GET /textimg, story
 *     on the rail, then the slideshow cycles photos in the left region.
 *     Needs: day2_config.h filled, backend running, SD photos in 0:\pictures.
 *     Story failure is non-fatal (photos still run). Never returns.
 *     Priority: RUN_ESP_PROBE > RUN_DAY2_TESTS > RUN_DAY3_DEMO > slideshow. */
#define RUN_DAY3_DEMO      (1)

/* 1 = photo-frame mode: show 0:\pictures\*.bmp on the LCD forever and skip
 *     the dual-model tests (falls through to the tests only if the slideshow
 *     cannot start — missing folder / no BMPs / display init failure).
 * 0 = Day-1 dual-model validation tests. */
#define RUN_SLIDESHOW      (1)

#define SLIDESHOW_DIR      "0:\\pictures"
#define SLIDESHOW_HOLD_MS  (3000)

/* Simulated face-recognition verdict, until the camera path exists: set to a
 * user named in the album label.json files (e.g. "user1") to play only that
 * user's albums; NULL = no filter (play everything, same as before). */
#define SLIDESHOW_SIM_USER ((const char *)NULL)

/* 1 = Phase-2: HM1055 camera preview in the bottom-right corner of the photo
 *     region, refreshed continuously between photos. Camera init failure is
 *     non-fatal (plain slideshow keeps running). Only affects RUN_DAY3_DEMO. */
#define RUN_CAMERA_PREVIEW (1)

/* 1 = Phase-3: run face detection (compiled-in yolo-fastest_192_face +
 *     DetectorPostProcessing) on each captured frame and draw the face boxes
 *     onto the preview. Needs RUN_CAMERA_PREVIEW. Init failure is non-fatal
 *     (preview keeps running without boxes). */
#define RUN_FACE_DETECT    (1)

/* 1 = Phase-4: face recognition. On each detected face, crop -> FaceMobileNet
 *     embedding -> cosine-match against SD references (0:\faces\embeddings.txt).
 *     Recognised faces are re-drawn with a green box; result logged on UART.
 *     Needs RUN_FACE_DETECT and 0:\face_mobilenet.tflite on the SD card. Init
 *     failure is non-fatal (detection keeps running). */
#define RUN_FACE_RECOG     (1)

/* 1 = ENROLL mode: instead of recognising, capture the largest detected face,
 *     compute its embedding and APPEND "ENROLL_LABEL:embedding" to the SD
 *     reference file, then stop. Flash once per person (change ENROLL_LABEL),
 *     then flash again with RUN_FACE_ENROLL=0 to recognise. Needs RUN_FACE_RECOG. */
#define RUN_FACE_ENROLL    (0)
#define ENROLL_LABEL       "user1"
#define ENROLL_AVG_FRAMES  (1)   /* frames to wait for a stable face before enrolling */

/* 1 = compile + run the Day-1 validation tests (and their whole UART log)
 *     whenever the slideshow doesn't take over.
 * 0 = Day-1 is signed off (see final_report.md): test code, boot log, tensor
 *     arenas and model objects are all compiled out. Flip back to 1 to re-run. */
#define RUN_DAY1_TESTS     (0)

/* Number of iterations per test (tune here). */
#define INFER_ITERS        (100)
#define ALT_SWITCHES       (500)   /* total model switches in Test 4 */

#if RUN_DAY1_TESTS

/*----------------------------------------------------------------------------
 * Tensor arenas — design "B": both interpreters stay RESIDENT (each Init'd
 * exactly once; MicroMutableOpResolver ops can only be registered once, so
 * re-Init is not allowed). One contiguous backing buffer, sliced, so placement
 * is deterministic: FACE first (max SRAM01 residency for the heavier model),
 * GESTURE after (its slice lands in the HyperRAM front guard).
 *--------------------------------------------------------------------------*/
namespace arm
{
namespace app
{
static uint8_t tensorArenas[FACE_ARENA_SZ + GESTURE_ARENA_SZ] ACTIVATION_BUF_ATTRIBUTE;
} /* namespace app */
} /* namespace arm */

/* Slice order chosen from measurement: gesture with its whole arena in
 * HyperRAM ran 177 ms (5.8x its SRAM figure of 30.6 ms), while face with only
 * its arena TAIL in HyperRAM stayed at 41.8 ms. TFLM allocates the traffic-
 * heavy non-persistent data (activations) from the arena HEAD and persistent
 * metadata from the TAIL — so: GESTURE first (fully inside SRAM01), FACE
 * second (its head stays in SRAM01, only the low-traffic tail spills into the
 * HyperRAM front guard). */
#define GESTURE_ARENA_PTR   (arm::app::tensorArenas)
#define FACE_ARENA_PTR      (arm::app::tensorArenas + GESTURE_ARENA_SZ)

/*----------------------------------------------------------------------------
 * Model registry (+ expected integrity values from scripts/compute_crc.py).
 *--------------------------------------------------------------------------*/
enum { MODEL_FACE = 0, MODEL_GESTURE, MODEL_COUNT };

