Yu-Ting-Sun/yiki-m55m1/main.cpp
static const ModelInfo kModels[MODEL_COUNT] =
{
    /* file,                size,    CRC32,       load_addr,          slot       */
    { FACE_MODEL_FILE,    2854848, 0x21B4B873, FACE_MODEL_ADDR,    MODEL_SLOT_SIZE },
    { GESTURE_MODEL_FILE, 2431552, 0xEBDA1FD1, GESTURE_MODEL_ADDR, MODEL_SLOT_SIZE },
};

static uint32_t s_loadedSize[MODEL_COUNT] = { 0, 0 };
static bool     s_loadOk[MODEL_COUNT]     = { false, false };
static bool     s_initOk[MODEL_COUNT]     = { false, false };

/* Persistent model objects (re-Init'd when switching over the shared arena). */
static arm::app::FaceModel    faceModel;
static arm::app::GestureModel gestureModel;

/*----------------------------------------------------------------------------
 * Small helpers
 *--------------------------------------------------------------------------*/
static uint32_t isqrt_u64(uint64_t v)
{
    uint64_t x = v, y = (x + 1) / 2;
    if (v == 0) return 0;
    while (y < x) { x = y; y = (x + v / x) / 2; }
    return (uint32_t)x;
}

/* Fill the input tensor with a varying non-zero pattern so a working NPU
 * produces non-trivial output (guards against "NPU never got data"). */
static void fill_input(arm::app::Model &model, uint32_t seed)
{
    TfLiteTensor *in = model.GetInputTensor(0);
    if (!in || !in->data.data) return;
    uint8_t *p = static_cast<uint8_t *>(in->data.data);
    for (size_t i = 0; i < in->bytes; i++)
        p[i] = (uint8_t)((i * 31u + seed * 7u + 1u) & 0xFFu);
}

/* Returns number of non-zero bytes in output tensor 0 (0 => NPU likely idle). */
static uint32_t output_nonzero_count(arm::app::Model &model)
{
    TfLiteTensor *out = model.GetOutputTensor(0);
    if (!out || !out->data.data) return 0;
    const uint8_t *p = static_cast<const uint8_t *>(out->data.data);
    uint32_t nz = 0;
    for (size_t i = 0; i < out->bytes; i++)
        if (p[i] != 0) nz++;
    return nz;
}

/* Cacheable-WTRA MPU region for the arena (mirrors the proven old project so
 * CPU<->NPU cache behaviour is identical). Requires the BSP InitPreDefMPURegion
 * helper + MAIR setup from mpu_config_M55M1.h. */
static void setup_arena_mpu(void)
{
    const ARM_MPU_Region_t mpuConfig[] =
    {
        {
            ARM_MPU_RBAR((unsigned int)arm::app::tensorArenas,
                         ARM_MPU_SH_NON, 0, 1, 1),
            ARM_MPU_RLAR((unsigned int)arm::app::tensorArenas + sizeof(arm::app::tensorArenas) - 1,
                         eMPU_ATTR_CACHEABLE_WTRA)
        },
    };
    InitPreDefMPURegion(&mpuConfig[0], sizeof(mpuConfig) / sizeof(mpuConfig[0]));
}

/*----------------------------------------------------------------------------
 * Test 1 — load both models + boot self-check (size + CRC32)
 *--------------------------------------------------------------------------*/
static bool test_load_both_models(void)
{
    printf("\n=== Test 1: Load Both Models (SD -> HyperRAM) ===\n");
    bool all_ok = true;

    for (int i = 0; i < MODEL_COUNT; i++)
    {
        const ModelInfo *m = &kModels[i];
        uint32_t size = 0, crc = 0;
        int rc = LoadModelToHyperRAM(m->file, m->load_addr, m->slot_size, &size, &crc);

        if (rc != 0)
        {
            all_ok = false;
            continue;
        }

        bool ok = true;
        if (size != m->expected_size)
        {
            printf_err("  SELFCHECK size mismatch: got %u, expected %u\n",
                       (unsigned)size, (unsigned)m->expected_size);
            ok = false;
        }
        if (crc != m->expected_crc32)
        {
            printf_err("  SELFCHECK CRC mismatch: got 0x%08X, expected 0x%08X\n",
                       (unsigned)crc, (unsigned)m->expected_crc32);
            ok = false;
        }
        if (ok)
            printf("  [SELFCHECK OK] size + CRC32 match expected\n");

        s_loadedSize[i] = size;
        s_loadOk[i]     = ok;
        all_ok          = all_ok && ok;
    }

    printf("Test 1 result: %s\n", all_ok ? "PASS" : "FAIL");
    return all_ok;
}

/*----------------------------------------------------------------------------
 * One-time interpreter construction. MicroMutableOpResolver rejects duplicate
 * op registration, so each Model object must be Init'd exactly once and then
 * stay resident — switching models later = just invoking the other object.
 *--------------------------------------------------------------------------*/
static bool init_model_once(arm::app::Model &model, int modelIdx,
                            uint8_t *arena, uint32_t arenaSz, const char *name)
{
    if (!s_loadOk[modelIdx])
    {
        printf_err("[INIT] %s skipped: model did not load/verify\n", name);
        return false;
    }

    uint32_t t0 = GetSystemTick_ms();
    bool ok = model.Init(arena, arenaSz,
                         (const uint8_t *)kModels[modelIdx].load_addr,
                         s_loadedSize[modelIdx]);
    uint32_t dt = GetSystemTick_ms() - t0;

    if (!ok)
    {
        printf_err("[INIT] %s model.Init() FAILED (arena %u KB @0x%08X)\n",
                   name, (unsigned)(arenaSz / 1024U), (unsigned)(uintptr_t)arena);
        return false;
    }

    printf("[INIT] %-8s interpreter resident: %u ms (arena %u KB @0x%08X)\n",
           name, (unsigned)dt, (unsigned)(arenaSz / 1024U), (unsigned)(uintptr_t)arena);
    s_initOk[modelIdx] = true;
    return true;
}

/*----------------------------------------------------------------------------
 * Inference benchmark (Tests 2 & 3) — model must already be Init'd.
 *--------------------------------------------------------------------------*/
static bool run_inference_bench(arm::app::Model &model, int modelIdx, const char *name)
{
    printf("\n=== Inference: %s (%d iterations) ===\n", name, INFER_ITERS);

    if (!s_initOk[modelIdx])
    {
        printf_err("  skipped: %s interpreter not initialised\n", name);
        return false;
    }

    uint64_t sum_us = 0, sumsq_us = 0;
    uint32_t max_us = 0, min_us = 0xFFFFFFFFu;
    uint32_t min_nz = 0xFFFFFFFFu;

    for (int i = 0; i < INFER_ITERS; i++)
    {
        fill_input(model, (uint32_t)i + 1u);

        uint32_t t0 = GetSystemTick_us();
        bool ran   = model.RunInference();
        uint32_t dt = GetSystemTick_us() - t0;

        if (!ran)
        {
            printf_err("  RunInference() failed at iter %d\n", i);
            return false;
        }

