Yu-Ting-Sun/yiki-m55m1/main.cpp
        uint32_t nz = output_nonzero_count(model);
        if (nz < min_nz) min_nz = nz;

        sum_us   += dt;
        sumsq_us += (uint64_t)dt * dt;
        if (dt > max_us) max_us = dt;
        if (dt < min_us) min_us = dt;
    }

    uint32_t avg_us = (uint32_t)(sum_us / INFER_ITERS);
    uint64_t var    = (sumsq_us / INFER_ITERS) - (uint64_t)avg_us * avg_us;
    uint32_t std_us = isqrt_u64(var);

    printf("  latency: avg=%u.%03u ms  max=%u.%03u ms  min=%u.%03u ms  std=%u us\n",
           avg_us / 1000, avg_us % 1000,
           max_us / 1000, max_us % 1000,
           min_us / 1000, min_us % 1000,
           std_us);
    printf("  output sanity: min non-zero bytes across runs = %u  -> %s\n",
           (unsigned)min_nz, (min_nz > 0) ? "OK (NPU produced data)"
                                          : "FAIL (all-zero output!)");

    /* BOTH criteria gate the verdict. (An earlier version returned only the
     * sanity check, so the final summary claimed PASS while the latency line
     * said FAIL — gesture @177 ms slipped through as a false PASS.) */
    bool latency_ok = (avg_us < 100000u);
    printf("  <100 ms target: %s\n", latency_ok ? "PASS" : "FAIL");

    return (min_nz > 0) && latency_ok;
}

/*----------------------------------------------------------------------------
 * Test 4 — alternating inference across two RESIDENT interpreters.
 * No re-Init per switch: MicroMutableOpResolver ops register once, so each
 * model was Init'd once (own arena slice) and switching = invoking the other
 * object. Switch overhead is therefore ~0; what we verify here is that 500
 * alternations run without crash, without cross-model state corruption, and
 * with sane (non-zero) NPU output every time.
 *--------------------------------------------------------------------------*/
static bool test_alternating(void)
{
    printf("\n=== Test 4: Alternating Inference (%d switches, resident interpreters) ===\n",
           ALT_SWITCHES);

    if (!s_initOk[MODEL_FACE] || !s_initOk[MODEL_GESTURE])
    {
        printf_err("  skipped: both interpreters must be initialised first\n");
        return false;
    }

    uint64_t inf_sum_us[MODEL_COUNT] = { 0, 0 };
    uint32_t inf_max_us[MODEL_COUNT] = { 0, 0 };
    uint32_t cnt[MODEL_COUNT]        = { 0, 0 };
    uint32_t min_nz_all              = 0xFFFFFFFFu;

    for (int i = 0; i < ALT_SWITCHES; i++)
    {
        int idx = i & 1;   /* alternate face / gesture */
        arm::app::Model &model = (idx == MODEL_FACE)
                                 ? static_cast<arm::app::Model &>(faceModel)
                                 : static_cast<arm::app::Model &>(gestureModel);

        fill_input(model, (uint32_t)i + 1u);

        uint32_t t0 = GetSystemTick_us();
        bool ran   = model.RunInference();
        uint32_t inf_us = GetSystemTick_us() - t0;

        if (!ran)
        {
            printf_err("  switch %d: RunInference() failed\n", i);
            printf("Test 4 result: FAIL at switch %d/%d\n", i, ALT_SWITCHES);
            return false;
        }

        uint32_t nz = output_nonzero_count(model);
        if (nz < min_nz_all) min_nz_all = nz;

        inf_sum_us[idx] += inf_us;
        if (inf_us > inf_max_us[idx]) inf_max_us[idx] = inf_us;
        cnt[idx]++;

        if (((i + 1) % 100) == 0)
            printf("  ...%d/%d switches ok\n", i + 1, ALT_SWITCHES);
    }

    for (int k = 0; k < MODEL_COUNT; k++)
    {
        if (cnt[k] == 0) continue;
        uint32_t inf_avg = (uint32_t)(inf_sum_us[k] / cnt[k]);
        printf("  %-8s: inference avg=%u.%03u ms  max=%u.%03u ms  (%u runs)\n",
               (k == MODEL_FACE) ? "FACE" : "GESTURE",
               inf_avg / 1000, inf_avg % 1000,
               inf_max_us[k] / 1000, inf_max_us[k] % 1000,
               (unsigned)cnt[k]);
    }
    printf("  switch overhead: ~0 (interpreters resident; no re-Init/re-alloc)\n");
    printf("  output sanity over all switches: min non-zero = %u -> %s\n",
           (unsigned)min_nz_all, (min_nz_all > 0) ? "OK" : "FAIL (all-zero!)");
    printf("Test 4 result: %s (%d/%d switches, no crash)\n",
           (min_nz_all > 0) ? "PASS" : "PARTIAL", ALT_SWITCHES, ALT_SWITCHES);

    return (min_nz_all > 0);
}

#endif /* RUN_DAY1_TESTS */

/*----------------------------------------------------------------------------
 * main
 *--------------------------------------------------------------------------*/
int main(void)
{
    BoardInit();          /* clocks, UART, HyperRAM map, SD mount, NPU init */

#if RUN_ESP_PROBE
    /* Must run before PerfTimer_Init(): the probe owns SysTick for delays. */
    esp_probe_run();      /* never returns */
#endif

    /* NOTE: no DWT register is read here anymore - touching DWT/CoreSight
     * without a live debug session hangs this board (standalone-reset bug). */
    if (PerfTimer_Init())             /* timing source: DWT, else SysTick */
        printf("[OK] timing source: DWT CYCCNT (cycle-accurate)\n");
    else
        printf("[OK] timing source: SysTick 64-bit (DWT disabled - see PerfTimer.h)\n");

#if RUN_DAY2_TESTS
    day2_test_run();      /* Wi-Fi + HTTP link validation; never returns */
#endif

#if RUN_DAY3_DEMO
    /* Day-3 demo: story rail + photo slideshow side by side. */
    if (Display_Init() == 0)
    {
        int d3 = day3_demo_run();
        if (d3 != 0)
            printf_err("Day-3 story failed (rc=%d) - running photos only\n", d3);

        Slideshow_ReserveRight(STORYUI_RESERVED_PX);
        Slideshow_SetFilter(SLIDESHOW_SIM_USER);

        int slrc;

        if (Slideshow_LibScan(SLIDESHOW_DIR) < 0)
            slrc = -1;
        else
        {
#if RUN_CAMERA_PREVIEW
            /* Preview sits in the bottom-right corner of the photo region.
             * No camera (init fail) degrades to the plain slideshow. */
            bool     camOk = (Camera_Init() == 0);
            uint32_t camX  = Disaplay_GetLCDWidth() - STORYUI_RESERVED_PX - CAM_W;
            uint32_t camY  = Disaplay_GetLCDHeight() - CAM_H;
#if RUN_FACE_DETECT
            /* Face detection draws boxes onto the frame before it is blitted.
             * Init failure degrades to plain preview (no boxes). */
            bool fdOk = camOk && (FaceDetect_Init() == 0);
#if RUN_FACE_RECOG
            bool frOk = fdOk && (FaceRecog_Init() == 0);
#endif
#if RUN_FACE_ENROLL
            bool enrolled  = false;
            int  enrollSeen = 0;
#endif
            /* Single combined arena MPU setup (cacheable WTRA): the BSP
             * configures all app MPU regions in ONE InitPreDefMPURegion call,
             * so both arenas are set together here rather than per module. */
            if (fdOk)
            {
                ARM_MPU_Region_t rg[2];
                uint32_t nrg = 0;
                void    *aBase; uint32_t aSize;

                FaceDetect_GetArena(&aBase, &aSize);
                rg[nrg].RBAR = ARM_MPU_RBAR((unsigned int)aBase, ARM_MPU_SH_NON, 0, 1, 1);
                rg[nrg].RLAR = ARM_MPU_RLAR((unsigned int)aBase + aSize - 1, eMPU_ATTR_CACHEABLE_WTRA);
                nrg++;
#if RUN_FACE_RECOG
                if (frOk)
                {
                    FaceRecog_GetArena(&aBase, &aSize);
                    rg[nrg].RBAR = ARM_MPU_RBAR((unsigned int)aBase, ARM_MPU_SH_NON, 0, 1, 1);
                    rg[nrg].RLAR = ARM_MPU_RLAR((unsigned int)aBase + aSize - 1, eMPU_ATTR_CACHEABLE_WTRA);
                    nrg++;
                }
#endif
                InitPreDefMPURegion(&rg[0], nrg);
            }
#endif
#endif

            for (;;)
            {
                slrc = Slideshow_ShowNext();
                if (slrc != 0) break;

